{
  "Afrodite": {
    "Pura": "PLACEHOLDER: Aqui vai o texto para quem é Afrodite Pura (Dominante e Secundária).",
    "Atena": "Arquétipo principal: Afrodite — a mulher da paixão, da entrega emocional e da busca por beleza e intensidade nos vínculos.\nArquétipo sombra: Atena — racional, estratégica, que busca controle e lógica.\nManifestação nos relacionamentos: Essa combinação cria uma mulher que ama profundamente, mas tenta racionalizar o amor. Ela se apaixona, sente tudo, mas logo busca entender, prever ou proteger-se da dor. Há conflito entre coração e mente, entre vulnerabilidade e autodefesa.\nAuto percepção: Sente-se dividida — quer viver o amor em plenitude, mas teme perder-se nele.\nExpressão da combinação: Paixão com lucidez. Quando integrada, transforma o amor em sabedoria emocional. Quando em desarmonia, vive o amor como campo de batalha entre emoção e razão.",
    "Deméter": "Arquétipo principal: Afrodite — o amor e o desejo que conectam.\nArquétipo sombra: Deméter — a mãe nutridora, que protege e cuida.\nManifestação nos relacionamentos: Ama com intensidade e se doa com generosidade, mas tende a se anular ou querer “salvar” o outro. Essa mulher ama com o corpo e o coração, mas precisa cuidar sem se perder no papel de “mãe afetiva”.\nAuto percepção: Sente-se viva quando ama, mas esgota-se quando cuida demais.\nExpressão da combinação: Amor que cura, mas precisa aprender limites. Quando equilibrada, é profundamente empática e inspiradora; quando não, atrai relações de dependência emocional.",
    "Ártemis": "Arquétipo principal: Afrodite — intensidade, desejo, magnetismo.\nArquétipo sombra: Ártemis — independência, liberdade e foco em si.\nManifestação nos relacionamentos: Vive o amor como expansão, mas precisa de liberdade. Essa mulher é magnética, apaixonante e avessa à rotina emocional. Pode afastar-se quando sente ameaça à sua autonomia.\nAuto percepção: Tem medo de ser presa, mas teme também a solidão.\nExpressão da combinação: Desejo e liberdade. Quando integrada, é criativa e inspiradora nos vínculos. Quando em sombra, alterna entre envolvimento profundo e distanciamento súbito.",
    "Perséfone": "Arquétipo principal: Afrodite — o amor, o corpo, o prazer.\nArquétipo sombra: Perséfone — o inconsciente, a profundidade emocional e o mistério.\nManifestação nos relacionamentos: Ama com intensidade quase espiritual. Atrai experiências transformadoras e, às vezes, relacionamentos cármicos. Oscila entre luz e sombra, prazer e dor.\nAuto percepção: Sente que o amor a consome e a renova. Vive cada vínculo como iniciação.\nExpressão da combinação: Amor profundo e místico. Quando em equilíbrio, transforma o amor em ferramenta de autoconhecimento. Quando em desequilíbrio, perde-se em amores que a sugam emocionalmente.",
    "Hera": "Arquétipo principal: Afrodite — a paixão e o desejo de conexão.\nArquétipo sombra: Hera — a esposa, o compromisso, a fidelidade, o status da união.\nManifestação nos relacionamentos: Deseja o amor intenso, mas quer estabilidade. Ama o fogo da conquista, mas teme o cotidiano. Quando não equilibrada, busca aprovação do parceiro como validação pessoal.\nAuto percepção: Sente-se incompleta sem o vínculo, mas sufocada quando ele limita sua liberdade.\nExpressão da combinação: Amor e compromisso. Quando integrada, constrói relacionamentos vivos e duradouros. Quando em sombra, vive entre paixão e posse.",
    "Héstia": "Arquétipo principal: Afrodite — a força criativa e o amor pela vida.\nArquétipo sombra: Héstia — o recolhimento, a calma e o foco no interior.\nManifestação nos relacionamentos: Ama com presença e serenidade. Essa mulher aprende a aquietar o fogo interno e a encontrar prazer na calma, não só na intensidade.\nAuto percepção: Aprende que o amor pode ser estável, não apenas avassalador.\nExpressão da combinação: Sensualidade com paz. Quando integrada, une magnetismo e profundidade emocional. Quando em sombra, teme perder o brilho se se aquietar demais."
  },
  "Atena": {
    "Pura": "PLACEHOLDER: Aqui vai o texto para quem é Atena Pura (Dominante e Secundária).",
    "Afrodite": "Arquétipo principal: Atena — racional, focada, estratégica.\nArquétipo sombra: Afrodite — emocional, sedutora e vulnerável.\nManifestação nos relacionamentos: Essa mulher ama com o intelecto. Quer compreender o amor, não apenas senti-lo. Quando se apaixona, tenta manter o controle — teme a perda da autonomia.\nAuto percepção: Vê o amor como aprendizado, mas sente-se travada para entregar-se.\nExpressão da combinação: Razão e desejo. Quando integrada, une sabedoria e paixão. Quando em sombra, racionaliza o afeto e impede o fluxo emocional.",
    "Deméter": "Arquétipo principal: Atena — estratégia e clareza mental.\nArquétipo sombra: Deméter — a mãe cuidadora e devotada.\nManifestação nos relacionamentos: Sente-se responsável por guiar e cuidar com eficiência. Pode “ensinar” o parceiro a amar de forma racional.\nAuto percepção: Vê-se como protetora e capaz, mas luta com o medo de parecer fria.\nExpressão da combinação: Cuidado inteligente. Quando equilibrada, é mentora e parceira sólida. Quando em sombra, vira controladora emocional.",
    "Ártemis": "Arquétipo principal: Atena — foco e racionalidade.\nArquétipo sombra: Ártemis — independência selvagem e conexão com o instinto.\nManifestação nos relacionamentos: Valoriza a liberdade e a escolha consciente. Ama, mas com limites claros. Pode parecer distante.\nAuto percepção: Vê-se como autossuficiente, mas sente vazio afetivo às vezes.\nExpressão da combinação: Clareza e liberdade. Quando integrada, cria vínculos baseados em respeito mútuo. Quando em sombra, isola-se por medo da vulnerabilidade.",
    "Perséfone": "Arquétipo principal: Atena — lucidez e estratégia.\nArquétipo sombra: Perséfone — sensibilidade, intuição e profundidade inconsciente.\nManifestação nos relacionamentos: Analisa o amor, mas é puxada por forças emocionais que não entende. Vive o paradoxo entre controle e entrega.\nAuto percepção: Sente-se sábia, mas às vezes confusa com o próprio coração.\nExpressão da combinação: Razão e intuição. Quando equilibrada, une discernimento e sensibilidade. Quando em sombra, vive dualidade e confusão emocional.",
    "Hera": "Arquétipo principal: Atena — racionalidade e planejamento.\nArquétipo sombra: Hera — compromisso, lealdade, status conjugal.\nManifestação nos relacionamentos: Quer um vínculo sólido, mas de igual para igual. Ama o casamento mental, não apenas o emocional.\nAuto percepção: Vê-se como parceira ideal, mas pode sentir que o amor restringe sua autonomia.\nExpressão da combinação: Estratégia e lealdade. Quando integrada, constrói relacionamentos sólidos e conscientes. Quando em sombra, torna o amor contrato e perde espontaneidade.",
    "Héstia": "Arquétipo principal: Atena — foco e sabedoria mental.\nArquétipo sombra: Héstia — introspecção e quietude interior.\nManifestação nos relacionamentos: Precisa de espaço mental e espiritual. Gosta de amor com serenidade.\nAuto percepção: Vê o silêncio como poder, mas teme desconexão emocional.\nExpressão da combinação: Lógica com paz. Quando integrada, tem clareza e centramento. Quando em sombra, racionaliza demais e se isola."
  },
  "Deméter": {
    "Pura": "PLACEHOLDER: Aqui vai o texto para quem é Deméter Pura (Dominante e Secundária).",
    "Afrodite": "Principal: Deméter — nutridora, generosa, cuidadora.\nSombra: Afrodite — paixão e desejo.\nManifestação: Ama cuidando e cuidando ama. Pode confundir amor com necessidade.\nAuto percepção: Acha que só é amada quando serve.\nExpressão: Amor que cura. Integrada, é acolhedora e sensível; em sombra, vive dependência afetiva.",
    "Atena": "Principal: Deméter — mãe arquetípica.\nSombra: Atena — razão e estratégia.\nManifestação: Quer cuidar, mas também organizar. Mistura amor e dever.\nAuto percepção: Sente-se pilar dos outros, mas carente de cuidado.\nExpressão: Cuidado estruturado. Integrada, é firme e empática; em sombra, se torna controladora pelo “bem”.",
    "Ártemis": "Principal: Deméter — doação e vínculo.\nSombra: Ártemis — autonomia e foco em si.\nManifestação: Divide-se entre cuidar e viver sua liberdade.\nAuto percepção: Sente culpa ao priorizar a si.\nExpressão: Cuidado com liberdade. Integrada, ensina amor com limites; em sombra, sente-se aprisionada.",
    "Perséfone": "Principal: Deméter — protetora e maternal.\nSombra: Perséfone — transformação, inconsciente e profundidade emocional.\nManifestação: Ama intensamente e teme perder quem ama.\nAuto percepção: Vive amor como missão.\nExpressão: Cuidado profundo. Integrada, acolhe e cura; em sombra, se anula pelo outro.",
    "Hera": "Principal: Deméter — doadora.\nSombra: Hera — compromisso e fidelidade conjugal.\nManifestação: Quer nutrir e sustentar lares. Tende a viver pelo outro.\nAuto percepção: Se define pelos vínculos.\nExpressão: Mãe e esposa arquetípica. Integrada, cria estabilidade; em sombra, vive abandono e ressentimento.",
    "Héstia": "Principal: Deméter — amor que nutre.\nSombra: Héstia — introspecção e serenidade.\nManifestação: Ama silenciosamente. Cuidar é sua oração.\nAuto percepção: Sente-se plena ao servir.\nExpressão: Amor sereno. Integrada, é luz suave; em sombra, se apaga emocionalmente."
  },
  "Ártemis": {
    "Pura": "PLACEHOLDER: Aqui vai o texto para quem é Ártemis Pura (Dominante e Secundária).",
    "Afrodite": "Principal: Ártemis — livre, instintiva, caçadora de si.\nSombra: Afrodite — sensualidade e emoção.\nManifestação: Ama e foge. Deseja intensidade, mas teme prisão emocional.\nAuto percepção: Valoriza autonomia e teme se perder no outro.\nExpressão: Liberdade apaixonada. Integrada, vive vínculos criativos; em sombra, sabota relações.",
    "Atena": "Principal: Ártemis — selvagem e intuitiva.\nSombra: Atena — racional e analítica.\nManifestação: Busca propósito e amor que respeite sua missão.\nAuto percepção: Vê-se como diferente; dificilmente se encaixa.\nExpressão: Liberdade com sabedoria. Integrada, inspira; em sombra, se distancia emocionalmente.",
    "Deméter": "Principal: Ártemis — foco em si e na liberdade.\nSombra: Deméter — cuidado e doação.\nManifestação: Quer amar sem se perder no cuidar.\nAuto percepção: Sente-se culpada por querer espaço.\nExpressão: Amor autêntico. Integrada, ama com presença sem perder essência; em sombra, se isola.",
    "Perséfone": "Principal: Ártemis — autonomia e instinto.\nSombra: Perséfone — vulnerabilidade e profundidade.\nManifestação: Quer viver o amor sem perder-se em emoções intensas.\nAuto percepção: Evita mergulhos emocionais por medo de dor.\nExpressão: Liberdade e profundidade. Integrada, une intuição e força; em sombra, vive solidão mascarada de força.",
    "Hera": "Principal: Ártemis — foco individual.\nSombra: Hera — vínculo, casamento, papel social.\nManifestação: Quer amar sem se prender.\nAuto percepção: Acha que o amor a atrasa.\nExpressão: Liberdade e compromisso. Integrada, redefine relacionamentos; em sombra, evita entrega.",
    "Héstia": "Principal: Ártemis — movimento e força.\nSombra: Héstia — silêncio e recolhimento.\nManifestação: Alterna entre ação e introspecção.\nAuto percepção: Sente-se incompreendida, precisa de espaço e solidão.\nExpressão: Liberdade serena. Integrada, é centrada e livre; em sombra, isolada e fria."
  },
  "Perséfone": {
    "Pura": "PLACEHOLDER: Aqui vai o texto para quem é Perséfone Pura (Dominante e Secundária).",
    "Afrodite": "Arquétipo principal: Perséfone — introspectiva, receptiva, intuitiva.\nArquétipo sombra: Afrodite — sensual, criativa, apaixonada.\nManifestação nos relacionamentos: Deseja conexão profunda, mas teme se perder nas paixões. Vive ciclos de entrega e recolhimento.\nAuto percepção: Sente-se misteriosa, emocionalmente complexa.\nExpressão da combinação: Alma e desejo. Quando integrada, une espiritualidade e prazer. Quando em sombra, é atraída por relações intensas e destrutivas.",
    "Atena": "Arquétipo principal: Perséfone — emocional e inconsciente.\nArquétipo sombra: Atena — lógica e estratégia.\nManifestação nos relacionamentos: Busca compreender o que sente, mas a mente analítica bloqueia o sentir.\nAuto percepção: Se acha confusa, vive entre razão e emoção.\nExpressão da combinação: Intuição lúcida. Integrada, enxerga o invisível com clareza; em sombra, vive paralisada entre pensar e sentir.",
    "Deméter": "Arquétipo principal: Perséfone — alma em transformação.\nArquétipo sombra: Deméter — cuidado, vínculo e proteção.\nManifestação nos relacionamentos: Ama com dependência, quer ser cuidada e livre ao mesmo tempo.\nAuto percepção: Oscila entre filha e mulher.\nExpressão da combinação: Cura emocional. Integrada, transforma vínculos; em sombra, repete laços de dependência.",
    "Ártemis": "Arquétipo principal: Perséfone — sensível e introspectiva.\nArquétipo sombra: Ártemis — livre, autossuficiente, centrada em si.\nManifestação nos relacionamentos: Busca fusão, mas teme abandono. Quer proximidade, mas não quer perder sua individualidade.\nAuto percepção: Sente-se incompreendida e instável.\nExpressão da combinação: Liberdade emocional. Integrada, é empática e autêntica; em sombra, alterna entre fuga e carência.",
    "Hera": "Arquétipo principal: Perséfone — emocional e inconsciente.\nArquétipo sombra: Hera — conjugal, voltada à lealdade e à forma.\nManifestação nos relacionamentos: Deseja compromisso profundo, mas atrai relações de poder ou dependência.\nAuto percepção: Vê-se intensa e leal, mas sente-se subjugada ou dominada.\nExpressão da combinação: Lealdade emocional. Integrada, cria vínculos de alma; em sombra, se prende a relações de controle.",
    "Héstia": "Arquétipo principal: Perséfone — psíquica, emocional, silenciosa.\nArquétipo sombra: Héstia — centrada, meditativa e introspectiva.\nManifestação nos relacionamentos: Precisa de solidão para se reencontrar. Ama em profundidade, mas em silêncio.\nAuto percepção: Vê-se como observadora e mística.\nExpressão da combinação: Profundidade e serenidade. Integrada, tem sabedoria espiritual; em sombra, se isola no mundo interior."
  },
  "Hera": {
    "Pura": "PLACEHOLDER: Aqui vai o texto para quem é Hera Pura (Dominante e Secundária).",
    "Afrodite": "Arquétipo principal: Hera — comprometida, devotada, voltada à parceria.\nArquétipo sombra: Afrodite — sensual, emocional, apaixonada.\nManifestação nos relacionamentos: Busca estabilidade, mas sente falta de paixão. Pode se sentir presa em papéis ou contratos afetivos.\nAuto percepção: Vê-se como mulher de valor, mas teme não ser desejada.\nExpressão da combinação: Compromisso com amor. Integrada, constrói vínculos vivos e fiéis; em sombra, vive entre controle e carência de afeto.",
    "Atena": "Arquétipo principal: Hera — valoriza a relação e o papel da parceria.\nArquétipo sombra: Atena — lógica, racional, estratégica.\nManifestação nos relacionamentos: Quer harmonia e fidelidade, mas usa a razão para manter o controle.\nAuto percepção: Acha que está “segurando tudo sozinha”.\nExpressão da combinação: Estrutura e clareza. Integrada, une sabedoria e compromisso; em sombra, domina o outro sob o disfarce de estabilidade.",
    "Deméter": "Arquétipo principal: Hera — conjugal, protetora, tradicional.\nArquétipo sombra: Deméter — maternal, doadora, emocional.\nManifestação nos relacionamentos: Vive para o outro, quer cuidar, manter e proteger. Sente-se responsável pela relação.\nAuto percepção: Se percebe como pilar da família ou do casal.\nExpressão da combinação: Amor devoto. Integrada, cria lares firmes e nutridos; em sombra, carrega tudo sozinha e perde a individualidade.",
    "Ártemis": "Arquétipo principal: Hera — voltada ao compromisso e à união.\nArquétipo sombra: Ártemis — livre, selvagem, autônoma.\nManifestação nos relacionamentos: Quer estabilidade, mas sente fascínio pela liberdade. Vive o dilema entre pertencer e fugir.\nAuto percepção: Vê-se como mulher dividida entre o que quer e o que precisa.\nExpressão da combinação: Liberdade com vínculo. Integrada, escolhe amar sem se aprisionar; em sombra, alterna entre ciúme e fuga emocional.",
    "Perséfone": "Arquétipo principal: Hera — lealdade, estrutura e hierarquia afetiva.\nArquétipo sombra: Perséfone — profundidade emocional e inconsciente.\nManifestação nos relacionamentos: Deseja vínculos eternos, mas se perde em jogos de poder e manipulação emocional.\nAuto percepção: Quer ser respeitada e compreendida, mas teme vulnerabilidade.\nExpressão da combinação: Compromisso e alma. Integrada, cria vínculos com propósito; em sombra, busca controle sob o nome de amor.",
    "Héstia": "Arquétipo principal: Hera — estruturada e voltada à união.\nArquétipo sombra: Héstia — introspectiva, silenciosa e espiritual.\nManifestação nos relacionamentos: Aprende a valorizar a intimidade e o silêncio dentro da relação.\nAuto percepção: Sente-se madura, mas às vezes solitária mesmo acompanhada.\nExpressão da combinação: Compromisso com paz. Integrada, traz serenidade à parceria; em sombra, se isola emocionalmente dentro do vínculo."
  },
  "Héstia": {
    "Pura": "PLACEHOLDER: Aqui vai o texto para quem é Héstia Pura (Dominante e Secundária).",
    "Afrodite": "Arquétipo principal: Héstia — centrada, tranquila e espiritual.\nArquétipo sombra: Afrodite — apaixonada, sensual, criativa.\nManifestação nos relacionamentos: Busca paz e harmonia, mas sente falta de intensidade. Pode se retrair diante do desejo.\nAuto percepção: Vê-se serena, mas teme ser “pouco emocionante”.\nExpressão da combinação: Paz e magnetismo. Integrada, irradia amor calmo e atraente; em sombra, reprime o desejo e se desconecta do prazer.",
    "Atena": "Arquétipo principal: Héstia — silenciosa e introspectiva.\nArquétipo sombra: Atena — racional, prática e lógica.\nManifestação nos relacionamentos: Prefere observar e compreender do que reagir. Ama com calma e reflexão.\nAuto percepção: Sente-se madura, mas distante emocionalmente.\nExpressão da combinação: Clareza interior. Integrada, une sabedoria e serenidade; em sombra, racionaliza tanto que se afasta do sentir.",
    "Deméter": "Arquétipo principal: Héstia — pacífica e centrada.\nArquétipo sombra: Deméter — maternal, acolhedora, protetora.\nManifestação nos relacionamentos: Ama de forma discreta e devocional. Pode cuidar em silêncio, sem pedir nada em troca.\nAuto percepção: Vê-se como base estável e confiável.\nExpressão da combinação: Amor silencioso. Integrada, é porto seguro; em sombra, se apaga para manter a harmonia.",
    "Ártemis": "Arquétipo principal: Héstia — calma, introspectiva e espiritual.\nArquétipo sombra: Ártemis — livre, selvagem, independente.\nManifestação nos relacionamentos: Ama com liberdade, sem apego, mas tende a se isolar.\nAuto percepção: Sente-se autossuficiente, às vezes inatingível.\nExpressão da combinação: Liberdade interior. Integrada, vive vínculos leves e autênticos; em sombra, fecha-se e evita envolvimento.",
    "Perséfone": "Arquétipo principal: Héstia — centrada e espiritual.\nArquétipo sombra: Perséfone — emocional, psíquica e misteriosa.\nManifestação nos relacionamentos: Vive o amor como espaço de introspecção e cura. Prefere profundidade à quantidade.\nAuto percepção: Sente-se antiga, sábia, mas distante do mundo.\nExpressão da combinação: Espiritualidade afetiva. Integrada, cura através da presença; em sombra, se esconde atrás do silêncio.",
    "Hera": "Arquétipo principal: Héstia — o templo interior, a calma e o recolhimento.\nArquétipo sombra: Hera — conjugal, social, estruturada.\nManifestação nos relacionamentos: Valoriza o lar e a harmonia, mas evita conflitos ou confrontos.\nAuto percepção: Vê-se como guardiã do espaço sagrado da relação.\nExpressão da combinação: Paz e compromisso. Integrada, cria vínculos estáveis e calmos; em sombra, se acomoda e silencia demais."
  }
}