{
  "Afrodite": {
    "Pura": "Arquétipo principal: Afrodite — sensualidade, desejo, intensidade e capacidade de criar intimidade rapidamente.\n\nArquétipo sombra: — Não há arquétipo sombra distinto, sendo a própria Afrodite plena.\n\nForça da combinação: Sensualidade natural, magnetismo, autenticidade emocional. Vive a vida com intensidade e recebe atenção sem esforço.\n\nSombra específica: Confunde intensidade com amor. Apaixona-se pela sensação, não pela pessoa. Cai em ciclos de picos emocionais — encantamento → entrega → frustração → vazio. Acha que precisa sentir “borboletas” para acreditar que algo é real. Pode normalizar relações instáveis porque o caos parece paixão.\n\nManifestação nos relacionamentos: Entra rápido demais. Idealiza e se decepciona com a mesma velocidade. Aceita migalhas emocionais porque o desejo momentâneo nublou o discernimento. Tende a ficar presa ao prazer instantâneo e perde profundidade.\n\nAuto percepção / Autoimagem: Vê-se intensa, profunda, apaixonada — mas guarda vergonha de “sentir demais”. Internamente, teme não ser amada quando a intensidade baixa.\n\nExpressão da combinação: Amor e desejo em estado puro. Quando integrada, transforma paixão em intimidade e presença genuína. Quando em sombra, vive ciclos emocionais instáveis e apego ao imediatismo.",
    "Atena": "Arquétipo principal: Afrodite — mulher da paixão, da entrega emocional e da busca por beleza e intensidade nos vínculos.\n\nArquétipo sombra: Atena — racional, estratégica, que busca controle e lógica.\n\nForça da combinação: Sensibilidade com estratégia. Você sente profundamente, mas também observa, analisa e entende padrões.\n\nSombra específica: A cabeça tenta controlar o que o coração escolheu. Conflitos internos aparecem como: “Eu quero, mas isso não faz sentido.” Você se culpa por sentir, racionaliza tudo, tenta prever o comportamento do outro e perde espontaneidade. Pode parecer autoconfiante por fora, mas na sombra analisa mensagens, cria hipóteses e se culpa por demonstrar emoção.\n\nManifestação nos relacionamentos: Essa combinação cria uma mulher que ama profundamente, mas tenta racionalizar o amor. Entra com intensidade (Afrodite), mas depois coloca a relação sob julgamento (Atena). Se o outro demonstra insegurança, você tende a perder interesse porque racionaliza demais a relação. Há conflito entre coração e mente, entre vulnerabilidade e autodefesa.\n\nAuto percepção / Autoimagem: Mulher forte, mas dividida. Sente-se dividida — quer viver o amor em plenitude, mas teme perder-se nele. Sente que “nenhum lado está certo”.\n\nExpressão da combinação: Paixão com lucidez. Quando integrada, transforma o amor em sabedoria emocional. Quando em desarmonia, vive o amor como campo de batalha entre emoção e razão.",
    "Deméter": "Arquétipo principal: Afrodite — o amor e o desejo que conectam.\n\nArquétipo sombra: Deméter — a mãe nutridora, que protege e cuida.\n\nForça da combinação: Combina o magnetismo e a capacidade de criar intimidade (Afrodite) com a presença nutritiva e a competência para cuidar (Deméter). Resultado: pessoa calorosa, que atrai e sustenta vínculos — cria ambientes onde as emoções são vivas e a prática de cuidado acontece.\n\nSombra específica: A tendência central é doar para manter o laço. Confunde ser indispensável com ser amada: oferta cuidado, presença e prazer como moeda. Quando o outro não retribui na mesma intensidade, tende a insistir, racionalizar a própria entrega e culpar-se pela falta de reciprocidade. Assume problemas alheios, silencia necessidades e normaliza relações onde vira a “resolvedora” emocional.\n\nManifestação nos relacionamentos: Ama com intensidade e se doa com generosidade, mas tende a se anular ou querer “salvar” o outro. Atrai parceiros emocionalmente frágeis que aceitam cuidados, mas não devolvem equivalência. Entra com calor e presença; fica por esperança de que “o outro mude” se continuar dando.\n\nAuto percepção / Autoimagem: Vê-se útil, amável e responsável. Orgulho em ser quem sustenta a relação. Emocionalmente, carrega vergonha de pedir e medo latente de abandono — prefere dobrar-se à entrega do que correr o risco de perder.\n\nExpressão da combinação: Amor que cura, mas precisa aprender limites. Quando equilibrada, é profundamente empática e inspiradora; quando não, atrai relações de dependência emocional.",
    "Ártemis": "Arquétipo principal: Afrodite — intensidade, desejo, magnetismo.\n\nArquétipo sombra: Ártemis — independência, liberdade e foco em si.\n\nForça da combinação: Intensidade + liberdade. Atrai naturalmente e mantém autonomia. Possui um magnetismo independente.\n\nSombra específica: Deseja conexão profunda sem perder o próprio espaço, mas não comunica essa necessidade. Atrai homens que se apaixonam rápido demais e depois sente pressão. Se sente presa, foge; se sente ignorada, volta. Ciclo de aproximação e afastamento (push-pull).\n\nManifestação nos relacionamentos: Vive o amor como expansão, mas precisa de liberdade. Apaixona-se pelo imaginário e perde interesse quando a relação exige rotina e constância. Tolerância para dependência emocional é nula.\n\nAuto percepção / Autoimagem: Mulher misteriosa, intensa e difícil de ser decifrada. Orgulho da sua liberdade e autossuficiência. Internamente, luta contra a solidão e teme perder a identidade ao ceder, gerando frustração silenciosa por não conseguir se entregar totalmente e culpa por afastar quem se importa.\n\nExpressão da combinação: Desejo e liberdade. Quando integrada, é criativa e inspiradora nos vínculos. Quando em sombra, alterna entre envolvimento profundo e distanciamento súbito.",
    "Perséfone": "Arquétipo principal: Afrodite — o amor, o corpo, o prazer.\n\nArquétipo sombra: Perséfone — o inconsciente, a profundidade emocional e o mistério.\n\nForça da combinação: Sensibilidade intensa, empatia profunda, intuição impressionante. Ama o “clima emocional” ao redor.\n\nSombra específica: Acha que pode “curar” o outro com amor. Atrai homens sombrios, confusos, imaturos ou emocionalmente indisponíveis. Interpreta profundidade onde existe apenas caos. Fica presa em relações kármicas.\n\nManifestação nos relacionamentos: Aceita migalhas porque projeta potencial no outro. Justifica comportamentos tóxicos dizendo que “entendeu a dor do outro”, diminuindo seus próprios limites. Ama com intensidade quase espiritual, atraindo experiências transformadoras e, às vezes, relacionamentos cármicos.\n\nAuto percepção / Autoimagem: Sente que o amor a consome e a renova. Frequentemente se vê como uma “esponja emocional” que absorve o peso alheio.\n\nExpressão da combinação: Amor profundo e místico. Quando em equilíbrio, transforma o amor em ferramenta de autoconhecimento. Quando em desequilíbrio, perde-se em amores que a sugam emocionalmente.",
    "Hera": "Arquétipo principal: Afrodite — a paixão e o desejo de conexão.\n\nArquétipo sombra: Hera — a esposa, o compromisso, a fidelidade, o status da união.\n\nForça da combinação: Ama com presença e lealdade, com a forte intenção de criar algo real. Entrega-se profundamente ao que acredita ser amor.\n\nSombra específica: Afrodite deseja conexão intensa; Hera quer compromisso. Isso gera apego rápido e permanência em relações instáveis, acreditando que “se eu insistir mais, isso vira algo sério”. Tende a confundir apego com destino.\n\nManifestação nos relacionamentos: Atrai parceiros indisponíveis emocionalmente, porém carismáticos. Insiste e permanece por tempo demais em relações com pouca correspondência emocional.\n\nAuto percepção / Autoimagem: Mulher dedicada, mas guarda medo profundo de rejeição e abandono. Sente-se incompleta sem vínculo, mas sufocada quando ele limita sua liberdade.\n\nExpressão da combinação: Amor e compromisso. Quando integrada, constrói relacionamentos vivos e duradouros. Quando em sombra, vive entre paixão e posse.",
    "Héstia": "Arquétipo principal: Afrodite — a força criativa e o amor pela vida.\n\nArquétipo sombra: Héstia — o recolhimento, a calma e o foco no interior.\n\nForça da combinação: Beleza interna, calma emocional, profundidade, presença sensível. Encanta pelo que é, não pelo que faz.\n\nSombra específica: Esconde suas emoções. Sente intensamente (Afrodite), mas guarda (Héstia). Cria relações onde ninguém sabe o que sente, espera que o outro adivinhe e sofre em silêncio.\n\nManifestação nos relacionamentos: Age como se o outro devesse “sentir” e adivinhar suas necessidades. Quando não é acolhida, retira-se com ressentimento e mágoa.\n\nAuto percepção / Autoimagem: Vê-se introspectiva e emocionalmente complexa. Essa complexidade é, no fundo, uma forma de isolamento emocional.\n\nExpressão da combinação: Sensualidade com paz. Quando integrada, une magnetismo e profundidade emocional. Quando em sombra, teme perder o brilho se se aquietar demais."
  },
  "Atena": {
    "Pura": "Arquétipo principal: Atena — racionalidade, estratégia, clareza mental e domínio intelectual.\n\nArquétipo sombra: — Não há arquétipo sombra distinto, sendo a própria Atena plena.\n\nForça da combinação: Sua força reside na clareza mental e estratégia. Enxerga padrões com facilidade, toma decisões racionais sob pressão e mantém controle no caos.\n\nSombra específica: Racionaliza tanto que não sente. Transforma emoções em tarefas, traumas em teorias e vulnerabilidade em vergonha. Acha que amar é “escolha”, tornando-se emocionalmente inacessível. Atrai parceiros que precisam de colo e sente irritação quando demonstram fragilidade. Prefere resolver sozinha a pedir ajuda.\n\nManifestação nos relacionamentos: Mantém distância emocional controlada. Não percebe que está sendo fria. Demonstra amor “com atitudes”, mas não com emoção. Tem dificuldade de confiar e foge de conversas emocionais profundas.\n\nAuto percepção / Autoimagem: Vê-se como forte, coerente e madura. Internamente, guarda profundo medo de ser julgada ou rejeitada se mostrar dor ou fraqueza.\n\nExpressão da combinação: Clareza e autocontrole. Quando integrada, é estrategista e resiliente; quando em sombra, emocionalmente inacessível e distante.",
    "Afrodite": "Arquétipo principal: Atena — racional, focada, estratégica.\n\nArquétipo sombra: Afrodite — emocional, sedutora e vulnerável.\n\nForça da combinação: Mentalidade estratégica com charme natural. Mulher magnética, inteligente e sedutora sem esforço. Passa segurança e encanto ao mesmo tempo.\n\nSombra específica: Vive duelo interno: “Sinto muito… mas penso demais.” Afrodite cria desejo; Atena tenta controlar. Demonstra interesse e depois recua. Atrai homens apaixonados que reclamam da frieza. Às vezes usa inteligência emocional para medir, não para se entregar.\n\nManifestação nos relacionamentos: Entra com química, mantém com lógica. Analisa comportamentos, mensagens e intenções. Medo de perder autonomia emocional. Desapega rápido se algo parece incoerente.\n\nAuto percepção / Autoimagem: Vê-se sedutora e inteligente, mas luta contra a culpa por parecer distante.\n\nExpressão da combinação: Razão e desejo. Quando integrada, une sabedoria e paixão; quando em sombra, racionaliza o afeto e impede o fluxo emocional.",
    "Deméter": "Arquétipo principal: Atena — estratégia e clareza mental.\n\nArquétipo sombra: Deméter — mãe cuidadora e devotada.\n\nForça da combinação: Equilíbrio entre racionalidade e acolhimento. Ama com constância, responsabilidade e estrutura. Constrói relações longas, estáveis e seguras.\n\nSombra específica: Cuidado vira controle. Acha que sabe o que é melhor para o outro. Se o parceiro é imaturo, assume papel de mãe; corrige, resolve e carrega o emocional da relação, criando dependência e exaustão.\n\nManifestação nos relacionamentos: Atrai parceiros que precisam de cuidado. Faz de tudo para evitar conflitos. Depois explode por não receber cuidado de volta.\n\nAuto percepção / Autoimagem: Vê-se responsável, madura e forte, mas sente falta de ser cuidada também.\n\nExpressão da combinação: Cuidado inteligente. Quando equilibrada, é mentora e parceira sólida; quando em sombra, torna-se controladora emocional.",
    "Ártemis": "Arquétipo principal: Atena — foco e racionalidade.\n\nArquétipo sombra: Ártemis — independência selvagem e conexão com instinto.\n\nForça da combinação: Autonomia profunda e clareza de ação. Não aceita pouco, não negocia valores, mantém firmeza.\n\nSombra específica: Independência excessiva que vira barreira afetiva. Permite aproximação até certo ponto, mas nunca entrega o centro. Pode se acostumar com solitude defensiva: “Se eu não dependo de ninguém, ninguém me decepciona.”\n\nManifestação nos relacionamentos: Interesse diminui quando o outro tenta se aproximar emocionalmente. Foge de vulnerabilidade. Cria relações mentais, não afetivas.\n\nAuto percepção / Autoimagem: Orgulho da própria força e capacidade de se bastar. Dificuldade em admitir solidão e falta de troca real.\n\nExpressão da combinação: Clareza e liberdade. Quando integrada, cria vínculos baseados em respeito mútuo; quando em sombra, isola-se por medo da vulnerabilidade.",
    "Perséfone": "Arquétipo principal: Atena — lucidez e estratégia.\n\nArquétipo sombra: Perséfone — sensibilidade, intuição e profundidade inconsciente.\n\nForça da combinação: Inteligência emocional e sensibilidade profunda. Mulher introspectiva, analítica e intuitiva. Percebe a raiz emocional das coisas com precisão.\n\nSombra específica: Vive muito na própria cabeça. Cria narrativas internas sobre o comportamento do outro. Entende tanta dor que tolera comportamentos nocivos. Explica demais e age de menos.\n\nManifestação nos relacionamentos: Ama em silêncio, antecipa rejeições, teme pedir amor, aceita pouco porque entende tudo.\n\nAuto percepção / Autoimagem: Vê-se profunda e complexa, mas frequentemente emocionalmente invisível e incompreendida.\n\nExpressão da combinação: Razão e intuição. Quando equilibrada, une discernimento e sensibilidade; quando em sombra, vive dualidade e confusão emocional.",
    "Hera": "Arquétipo principal: Atena — racionalidade e planejamento.\n\nArquétipo sombra: Hera — compromisso, lealdade e status conjugal.\n\nForça da combinação: Compromisso, lealdade, clareza emocional e maturidade. Constrói relações sólidas e adultas.\n\nSombra específica: Confunde responsabilidade com obrigação emocional. Tenta manter a relação “funcionando” mesmo quando o outro já saiu emocionalmente.\n\nManifestação nos relacionamentos: Aposta alto quando acredita em alguém. Assume funções emocionais que não são suas. Sente peso em relações instáveis.\n\nAuto percepção / Autoimagem: Parceira confiável e adulta, mas sente-se exausta e sozinha no esforço de carregar a estabilidade da relação.\n\nExpressão da combinação: Estratégia e lealdade. Quando integrada, constrói relacionamentos sólidos e conscientes; quando em sombra, torna o amor contrato e perde espontaneidade.",
    "Héstia": "Arquétipo principal: Atena — foco e sabedoria mental.\n\nArquétipo sombra: Héstia — introspecção e quietude interior.\n\nForça da combinação: Estabilidade interna, clareza mental e calma. Mulher silenciosamente poderosa.\n\nSombra específica: Emocionalmente inacessível. Não se abre, não mostra dor ou insegurança. Guarda feridas não nomeadas.\n\nManifestação nos relacionamentos: Autossuficiência emocional exagerada. Dificuldade de depender de alguém. Isola-se quando sofre.\n\nAuto percepção / Autoimagem: Discreta, forte, equilibrada, mas internamente carente de troca emocional real.\n\nExpressão da combinação: Lógica com paz. Quando integrada, tem clareza e centramento; quando em sombra, racionaliza demais e se isola."
  },
  "Deméter": {
    "Pura": "Arquétipo principal: Deméter — a nutridora, presente, firme, que ama cuidando.\n\nSombra: — Não se aplica no perfil puro.\n\nForça / Qualidade: Dá estabilidade e segurança. Sua presença gera aconchego e confiança; é referência de cuidado e proteção.\n\nManifestação nos relacionamentos: Sente prazer em cuidar e apoiar, mas tende a se sobrecarregar por assumir responsabilidades alheias. Atrai parceiros que precisam de cuidado e orientação, mas nem sempre retribuem.\n\nAuto percepção / Autoimagem: Sente-se essencial e forte, mas às vezes solitária, com medo de não ser valorizada se não estiver “fazendo algo pelo outro”.\n\nExpressão: Amor que sustenta e cura. Integrada, é acolhedora, equilibrada e empática; em sombra, se perde em relações de dependência e sobrecarga emocional.",
    "Afrodite": "Arquétipo principal: Deméter — nutridora e protetora.\n\nSombra: Afrodite — paixão, desejo e intensidade emocional.\n\nForça / Qualidade: Combina cuidado com magnetismo. Atrai as pessoas pelo charme natural, mas permanece pelo acolhimento genuíno.\n\nManifestação nos relacionamentos: Ama intensamente e se doa com calor; pode confundir desejo e paixão com amor real. Tende a se prender a relações onde sente que é “a responsável por fazer o outro florescer”.\n\nAuto percepção / Autoimagem: Encantadora e generosa, mas insegura no centro; teme que, se parar de cuidar, será esquecida.\n\nExpressão: Amor que cura e seduz. Integrada, gera vínculos profundos e afetuosos; em sombra, mantém relações desequilibradas e dependentes.",
    "Atena": "Arquétipo principal: Deméter — cuidadora e protetora.\n\nSombra: Atena — lógica, estratégia e controle mental.\n\nForça / Qualidade: Consegue cuidar de forma organizada e estruturada, equilibrando afeto com razão.\n\nManifestação nos relacionamentos: Tende a guiar e corrigir o outro, misturando amor com dever. Pode sobrecarregar-se tentando manter a relação “funcionando”, sacrificando suas próprias necessidades.\n\nAuto percepção / Autoimagem: Sente-se pilar dos outros; orgulhosa de sua capacidade de sustentar vínculos, mas carente de cuidado genuíno.\n\nExpressão: Cuidado estratégico. Integrada, é firme, segura e acolhedora; em sombra, se torna controladora, exigente e emocionalmente sobrecarregada.",
    "Ártemis": "Arquétipo principal: Deméter — doação, cuidado e vínculo.\n\nSombra: Ártemis — independência, autonomia, foco em si.\n\nForça / Qualidade: Ama cuidando, mas sabe estabelecer limites. Mantém seu espaço sem abrir mão da empatia.\n\nManifestação nos relacionamentos: Oscila entre estar presente e se afastar para preservar autonomia. Pode se culpar por priorizar a si mesma e atrair parceiros que testam seus limites de cuidado e liberdade.\n\nAuto percepção / Autoimagem: Gentil, justa e forte, mas sente medo de perder sua própria identidade no amor.\n\nExpressão: Amor com limites. Integrada, ensina a cuidar sem se perder; em sombra, sente-se aprisionada e confusa entre entrega e liberdade.",
    "Perséfone": "Arquétipo principal: Deméter — protetora, acolhedora, maternal.\n\nSombra: Perséfone — introspecção, sensibilidade profunda, inconsciente emocional.\n\nForça / Qualidade: Capacidade de amar com profundidade e intuição, entendendo a dor do outro.\n\nManifestação nos relacionamentos: Ama intensamente, mas teme se perder nos vínculos. Atrai parceiros emocionalmente confusos ou dependentes. Pode assumir a responsabilidade emocional alheia.\n\nAuto percepção / Autoimagem: Vê-se como cuidadora e salvadora, mas vive receio de que parar de cuidar significará abandono.\n\nExpressão: Amor transformador. Integrada, acolhe e cura; em sombra, se anula e repete padrões de dependência emocional.",
    "Hera": "Arquétipo principal: Deméter — amor que sustenta, protege e nutre.\n\nSombra: Hera — compromisso, fidelidade e estrutura relacional.\n\nForça / Qualidade: Cria vínculos profundos e estáveis; lealdade intensa e consistente.\n\nManifestação nos relacionamentos: Quer construir lares e vínculos duradouros. Pode permanecer em relações desgastadas por medo de perder ou sentir que é responsável pelo outro.\n\nAuto percepção / Autoimagem: Sente-se dedicada e essencial, mas, às vezes, sufocada e ressentida.\n\nExpressão: Amor leal. Integrada, constrói relações estáveis e seguras; em sombra, carrega a dor do abandono ou falta de reciprocidade.",
    "Héstia": "Arquétipo principal: Deméter — amor sereno, nutridor, acolhedor.\n\nSombra: Héstia — introspecção, recolhimento, quietude interior.\n\nForça / Qualidade: Acolhe e sustenta em silêncio, transmitindo paz e serenidade.\n\nManifestação nos relacionamentos: Ama de forma discreta, valorizando harmonia. Pode se sentir invisível ou subestimada.\n\nAuto percepção / Autoimagem: Sente-se completa ao cuidar, mas teme não ser vista ou valorizada.\n\nExpressão: Amor sereno e silencioso. Integrada, irradia calor e estabilidade; em sombra, se apaga emocionalmente e se isola."
  },
  "Ártemis": {
    "Pura": "Arquétipo principal: Ártemis — independência, liberdade, instinto, autonomia.\n\nArquétipo sombra: — Não há sombra distinta; é pura liberdade.\n\nForça da combinação: Foco, autossuficiência e clareza interna. Sabe quem é mesmo quando ninguém está olhando. Não precisa de aprovação externa.\n\nSombra específica: Prefere se isolar a se perder para outra pessoa. Tem dificuldade em dividir vulnerabilidade ou pedir ajuda, mesmo quando sente necessidade. Pode abandonar relações importantes para manter sua autonomia.\n\nManifestação nos relacionamentos: Mantém distância emocional quando sente cobrança ou pressão. Atrai parceiros que sejam igualmente livres, mas muitas vezes imaturos ou emocionalmente indisponíveis. Seu padrão é se conectar, sentir intensidade e depois recuar para proteger sua liberdade.\n\nAutoimagem: Se vê como autossuficiente e resiliente, mas por dentro enfrenta solidão silenciosa e medo de depender de alguém.\n\nExpressão da combinação: Liberdade plena. Quando integrada, vive vínculos criativos e respeitosos. Quando em sombra, sabota relações e evita entrega emocional.",
    "Afrodite": "Arquétipo principal: Ártemis — livre, instintiva, caçadora de si.\n\nArquétipo sombra: Afrodite — sensualidade, emoção e desejo.\n\nForça da combinação: União de independência com magnetismo natural. Atrai intensamente sem perder autonomia. Tem desejo de amor, paixão e prazer, mas sempre preservando seu espaço.\n\nSombra específica: Deseja intensidade, mas teme perder liberdade. Alterna entre se aproximar e se afastar, gerando ciclos de “amor e fuga”. Pode se envolver com parceiros que despertam paixão imediata, mas que não estão disponíveis emocionalmente.\n\nManifestação nos relacionamentos: Apaixona-se pelo imaginário, pelo ideal de alguém que respeite sua liberdade, mas foge quando percebe exigência emocional. Pode confundir paixão com dependência emocional do outro.\n\nAutoimagem: Sente-se poderosa e magnética, mas teme se perder no outro. Internamente, vive conflito entre desejo de conexão e preservação do próprio espaço.\n\nExpressão da combinação: Liberdade apaixonada. Integrada, consegue amar intensamente sem se submeter. Em sombra, sabota relações, se distancia e mantém barreiras emocionais.",
    "Atena": "Arquétipo principal: Ártemis — intuitiva, instintiva, livre.\n\nArquétipo sombra: Atena — racional, estratégica e analítica.\n\nForça da combinação: Claridade de propósito aliada à disciplina e racionalidade. Ama, mas escolhe onde e como investir seu afeto. Consegue agir com estratégia sem perder instinto.\n\nSombra específica: Usa a racionalidade como escudo para não se machucar. Racionaliza sentimentos, analisa cada gesto do outro e evita vulnerabilidade. Pode parecer fria ou distante, mesmo que sinta profundamente.\n\nManifestação nos relacionamentos: Se afasta de relações que exigem entrega emocional profunda. Atrai parceiros que admiram sua força, mas que podem se sentir rejeitados por sua barreira emocional.\n\nAutoimagem: Orgulha-se da própria autonomia e clareza, mas sente dificuldade em confiar e se permitir ser cuidada.\n\nExpressão da combinação: Liberdade com sabedoria. Quando integrada, cria vínculos respeitosos e equilibrados; quando em sombra, mantém distância emocional e controla a intimidade.",
    "Deméter": "Arquétipo principal: Ártemis — foco em si e liberdade.\n\nArquétipo sombra: Deméter — cuidado, doação, presença nutritiva.\n\nForça da combinação: Une independência com capacidade de cuidar. Ama com presença sem se anular, oferecendo atenção e suporte sem perder autonomia.\n\nSombra específica: Oscila entre querer se cuidar e sentir culpa por precisar do outro. Pode sobrecarregar-se ajudando e, em seguida, se isolar. Atrai parceiros imaturos que dependem dela ou muito independentes que não oferecem reciprocidade emocional.\n\nManifestação nos relacionamentos: Busca relacionamentos em que possa apoiar sem perder-se, mas muitas vezes sente frustração por não ser compreendida.\n\nAutoimagem: Sente-se forte e responsável, mas deseja ser amada sem precisar carregar tudo.\n\nExpressão da combinação: Amor autêntico com limites claros. Integrada, ama sem perder essência; em sombra, se isola ou cede demais ao cuidado do outro.",
    "Perséfone": "Arquétipo principal: Ártemis — autonomia, instinto, liberdade.\n\nArquétipo sombra: Perséfone — vulnerabilidade, profundidade emocional.\n\nForça da combinação: União de instinto com intuição profunda. Capaz de perceber emoções sutis sem perder força ou autonomia.\n\nSombra específica: Vive conflito interno entre desejo de proximidade e medo da dor emocional. Pode se envolver com parceiros confusos ou emocionalmente indisponíveis.\n\nManifestação nos relacionamentos: Alterna entre entrega e afastamento. Aceita relações que estimulam resgate emocional, mas sente frustração silenciosa.\n\nAutoimagem: Se vê forte e independente, mas internamente experimenta caos emocional disfarçado de controle.\n\nExpressão da combinação: Liberdade e profundidade. Integrada, une força e intuição; em sombra, vive solidão e conflitos internos.",
    "Hera": "Arquétipo principal: Ártemis — foco individual.\n\nArquétipo sombra: Hera — vínculo, compromisso, fidelidade.\n\nForça da combinação: Capacidade de amar com limites, buscando relações de respeito mútuo. Sabe se conectar sem se perder no outro.\n\nSombra específica: Quer vínculo profundo, mas teme perder liberdade. Alterna entre envolvimento e afastamento. Atrai parceiros dominantes ou excessivamente passivos, frustrando-se em ambos os casos.\n\nManifestação nos relacionamentos: Vive tensão entre desejo de união e necessidade de espaço. Pode atrair parceiros que desafiam sua autonomia.\n\nAutoimagem: Se acha difícil de amar, quando na verdade apenas não aceita ser presa.\n\nExpressão da combinação: Liberdade e compromisso. Integrada, constrói relacionamentos conscientes; em sombra, evita entrega emocional completa.",
    "Héstia": "Arquétipo principal: Ártemis — ação, liberdade, instinto.\n\nArquétipo sombra: Héstia — introspecção, recolhimento, silêncio interior.\n\nForça da combinação: Serenidade e força interna. Consegue viver seu mundo interior sem depender da validação externa.\n\nSombra específica: Se isola excessivamente, tem dificuldade em pedir ajuda ou se abrir. Cria barreiras emocionais que dificultam relações profundas.\n\nManifestação nos relacionamentos: Atrai parceiros distantes ou excessivamente seguros. Mantém proteção do próprio espaço em excesso, afastando oportunidades de intimidade real.\n\nAutoimagem: Se sente bem sozinha, mas internamente sente falta de um lugar para pousar e ser acolhida.\n\nExpressão da combinação: Liberdade serena. Integrada, combina presença e paz interior; em sombra, isolamento e frieza emocional."
  },
  "Perséfone": {
    "Pura": "Arquétipo principal: Perséfone — sensível, introspectiva, profunda, conectada ao inconsciente e ao invisível.\n\nArquétipo sombra: — Não há sombra distinta; é a própria profundidade.\n\nForça da combinação: Sensibilidade intensa, empatia verdadeira, intuição fina. Consegue perceber nuances emocionais que ninguém mais nota.\n\nSombra específica: Se adapta demais aos outros, dissolvendo sua própria identidade para evitar conflitos. Atrai pessoas dominadoras, manipuladoras ou emocionalmente dependentes. Tende a amar “em silêncio”, esperando que suas necessidades sejam percebidas sem precisar pedir.\n\nManifestação nos relacionamentos: Atrai parceiros intensos, sombrios, instáveis ou emocionalmente vulneráveis. Fica “porque entende a dor deles”, tolerando excesso ou falta de reciprocidade.\n\nAutoimagem: Profunda, sensível, intuitiva — mas teme parecer fraca se se impor.\n\nExpressão da combinação: Profundidade e intuição. Integrada, transforma vínculos em experiências de crescimento emocional; em sombra, perde-se em relações de absorção e dependência.",
    "Afrodite": "Arquétipo principal: Perséfone — introspectiva, sensível, intuitiva.\n\nArquétipo sombra: Afrodite — sensual, criativa, apaixonada.\n\nForça da combinação: Sensibilidade combinada com magnetismo. Atrai e encanta sem esforço; capaz de amar de forma profunda e sedutora.\n\nSombra específica: Confunde intensidade com amor. Se apaixona por almas feridas e homens carismáticos, mas emocionalmente indisponíveis. Corre risco de se perder em ciclos emocionais intensos e destrutivos.\n\nManifestação nos relacionamentos: Entrega-se profundamente, mas pode tolerar falta de reciprocidade ou relacionamentos instáveis. Vive ciclos de encantamento e desilusão.\n\nAutoimagem: Encantadora, profunda e atraente, mas vulnerável internamente.\n\nExpressão da combinação: Alma e desejo. Integrada, une espiritualidade e prazer; em sombra, se envolve em relações que drenam sua energia emocional.",
    "Atena": "Arquétipo principal: Perséfone — emocional e intuitiva.\n\nArquétipo sombra: Atena — lógica, analítica, estratégica.\n\nForça da combinação: Intuição com clareza mental. Capaz de sentir e compreender simultaneamente, combinando sensibilidade e discernimento.\n\nSombra específica: Racionaliza sentimentos, cria narrativas internas para justificar comportamentos do outro. Tolerância excessiva ao intolerável.\n\nManifestação nos relacionamentos: Aceita migalhas emocionais e idealiza o outro em silêncio, permanecendo em relações que machucam.\n\nAutoimagem: Profunda e consciente, mas silenciosamente carente.\n\nExpressão da combinação: Intuição lúcida. Integrada, enxerga o invisível com clareza; em sombra, fica paralisada entre pensar e sentir.",
    "Deméter": "Arquétipo principal: Perséfone — alma em transformação, sensível e empática.\n\nArquétipo sombra: Deméter — cuidado, presença, proteção.\n\nForça da combinação: Empatia acolhedora e capacidade de nutrir emocionalmente sem perder essência.\n\nSombra específica: Fusão emocional excessiva. Assume a dor do outro como missão própria, sofrendo quando não consegue salvar ou ajudar.\n\nManifestação nos relacionamentos: Atrai parceiros feridos, instáveis ou dependentes. Permanece para “curar” ou “salvar” o outro.\n\nAutoimagem: Doce, amorosa e profunda, mas emocionalmente sugada.\n\nExpressão da combinação: Cura emocional. Integrada, transforma vínculos; em sombra, repete padrões de dependência.",
    "Ártemis": "Arquétipo principal: Perséfone — sensível, introspectiva.\n\nArquétipo sombra: Ártemis — livre, autossuficiente, centrada em si.\n\nForça da combinação: Intuição profunda com independência emocional. Sabe amar sem se perder no outro.\n\nSombra específica: Alterna entre entregar amor e desaparecer para se proteger. Pode afastar-se quando percebe invasão ou pressão emocional.\n\nManifestação nos relacionamentos: Procura proximidade, mas mantém limites rígidos. Atrai parceiros que confundem sensibilidade com fragilidade.\n\nAutoimagem: Livre, sensível e justa, mas teme ser devorada emocionalmente.\n\nExpressão da combinação: Liberdade emocional. Integrada, ama com autenticidade e empatia; em sombra, alterna entre fuga e carência.",
    "Hera": "Arquétipo principal: Perséfone — emocional, inconsciente, profunda.\n\nArquétipo sombra: Hera — conjugal, leal, voltada à estabilidade e compromisso.\n\nForça da combinação: Capacidade de criar vínculos profundos e duradouros, com lealdade emocional real.\n\nSombra específica: Compromete-se cedo demais e entrega lealdade antes de receber. Atrai parceiros dominadores, carentes ou instáveis, tolerando excessivamente para manter vínculo.\n\nManifestação nos relacionamentos: Vínculos intensos e profundos, mas com risco de dependência afetiva e sufocamento.\n\nAutoimagem: Leal, profunda e comprometida, mas às vezes se sente sobrecarregada ou subjugada.\n\nExpressão da combinação: Lealdade emocional. Integrada, cria relações de alma; em sombra, mantém-se presa a vínculos de controle.",
    "Héstia": "Arquétipo principal: Perséfone — psíquica, emocional, silenciosa.\n\nArquétipo sombra: Héstia — introspectiva, centrada, meditativa.\n\nForça da combinação: Profundidade serena, intuição com paz interior, silêncio que acolhe e transforma.\n\nSombra específica: Fica invisível emocionalmente. Ninguém percebe suas necessidades. Pode anular-se para manter harmonia ou evitar conflitos.\n\nManifestação nos relacionamentos: Vive relações mornas ou silenciosamente solitárias. Atrai parceiros que não percebem suas necessidades.\n\nAutoimagem: Profunda e calma, mas frequentemente não vista ou reconhecida.\n\nExpressão da combinação: Profundidade e serenidade. Integrada, tem sabedoria espiritual e emocional; em sombra, se esconde atrás do silêncio e da contenção."
  }, 
  "Hera": {
    "Pura": "Arquétipo principal: Hera — comprometida, estruturada, protetora, leal.\n\nArquétipo sombra: Hera — tende a repetir padrões de excesso de controle, apego e medo de abandono.\n\nForça / Qualidade: Capacidade extrema de construir vínculos sólidos e duradouros. Tem talento natural para criar harmonia, estabilidade e segurança na relação, sendo confiável, presente e consistente. É visionária no planejamento da vida a dois e na criação de lares, sendo referência de fidelidade e maturidade emocional.\n\nManifestação nos relacionamentos: Vive um amor centrado em estabilidade, compromisso e parceria. Atrai parceiros que também valorizam lealdade e segurança, mas pode se sentir frustrada quando o outro não corresponde com a mesma intensidade. Tem tendência a assumir responsabilidade pelo relacionamento como um todo, cuidando da manutenção do vínculo emocional e prático.\n\nAuto percepção / Autoimagem: Se vê como pilar da relação, confiável e imprescindível. Tem orgulho de sua dedicação e fidelidade, mas carrega internamente o medo de que o vínculo desmorone caso o parceiro falhe ou não corresponda. Tem consciência de sua força, mas também da solidão que acompanha a extrema responsabilidade emocional.\n\nExpressão: Integrada: Cria relações estáveis, seguras e profundas; consegue amar com dedicação sem perder identidade, respeitando limites próprios e do parceiro. Inspira confiança e transmite sensação de lar e acolhimento. Em sombra: Assume controle excessivo, sufoca o parceiro com excesso de cuidado ou cobrança, e confunde apego com amor verdadeiro. Pode se prender a relações que já não funcionam, tolerando abusos ou desequilíbrios emocionais por medo de perder a segurança do vínculo.",
    "Afrodite": "Arquétipo principal: Hera — comprometida, devotada, voltada à parceria.\n\nArquétipo sombra: Afrodite — sensual, emocional, apaixonada.\n\nForça / Qualidade: Lealdade intensa combinada com magnetismo natural. Capacidade de construir relacionamentos duradouros e profundos, mantendo presença emocional e charme.\n\nManifestação nos relacionamentos: Busca estabilidade e segurança, mas deseja ser desejada. Pode se sentir dividida entre conforto do vínculo e a paixão arrebatadora. Atrai parceiros que desejam compromisso, mas muitas vezes emocionalmente dispersos.\n\nAuto percepção / Autoimagem: Se percebe como mulher de valor, confiável e parceira ideal. Internamente teme não ser amada pelo que é, especialmente no aspecto sensual.\n\nExpressão: Integrada: Constrói vínculos vivos e fiéis; sabe equilibrar compromisso e desejo. Em sombra: Vive entre controle e carência de afeto; pode manipular sutilmente para garantir atenção ou medo de perder.",
    "Atena": "Arquétipo principal: Hera — valoriza a relação e o papel da parceria.\n\nArquétipo sombra: Atena — lógica, racional, estratégica.\n\nForça / Qualidade: Capacidade de unir inteligência e compromisso. Sabe pensar estratégias para manter relações saudáveis sem perder autenticidade.\n\nManifestação nos relacionamentos: Usa a razão para manter harmonia e segurança. Tenta \"consertar\" parceiros e situações, mesmo quando não há vontade de mudança do outro. Atrai parceiros intelectualmente fortes, ou inseguros que precisam de guia.\n\nAuto percepção / Autoimagem: Sente que carrega responsabilidade demais sobre os ombros e que sustenta a relação sozinha.\n\nExpressão: Integrada: Une sabedoria e compromisso; consegue impor limites e guiar de forma saudável. Em sombra: Pode se tornar controladora, justificando o controle como cuidado; tende a racionalizar injustiças emocionais do parceiro.",
    "Deméter": "Arquétipo principal: Hera — conjugal, protetora, tradicional.\n\nArquétipo sombra: Deméter — maternal, doadora, emocional.\n\nForça / Qualidade: Amor devoto, cuidado consistente, capacidade de nutrir e sustentar lares e vínculos.\n\nManifestação nos relacionamentos: Vive para o outro, sente-se responsável pela harmonia e estabilidade da relação. Atrai parceiros dependentes, frágeis ou que não assumem responsabilidades emocionais.\n\nAuto percepção / Autoimagem: Se vê como pilar do casal ou da família, mas sente desgaste constante e carrega solidão emocional.\n\nExpressão: Integrada: Cria lares firmes, nutridos e seguros; promove união e estabilidade. Em sombra: Se sobrecarrega emocionalmente, sacrificando desejos próprios; assume papéis que não são dela e pode se sentir invisível dentro da relação.",
    "Ártemis": "Arquétipo principal: Hera — voltada ao compromisso e à união.\n\nArquétipo sombra: Ártemis — livre, selvagem, autônoma.\n\nForça / Qualidade: Capacidade de manter vínculo com presença firme, mesmo frente à necessidade de liberdade. Lealdade madura, mas não submissa.\n\nManifestação nos relacionamentos: Vive tensão entre pertencer e preservar liberdade. Fascínio por parceiros que representem autonomia e desafio. Oscila entre desejo de proximidade e necessidade de espaço.\n\nAuto percepção / Autoimagem: Se vê dividida entre o que quer (liberdade) e o que precisa (compromisso).\n\nExpressão: Integrada: Escolhe amar sem se aprisionar, mantém autonomia e vínculo ao mesmo tempo. Em sombra: Alterna entre ciúme e fuga emocional; tende a sabotar vínculos por medo de perda de liberdade.",
    "Perséfone": "Arquétipo principal: Hera — lealdade, estrutura e hierarquia afetiva.\n\nArquétipo sombra: Perséfone — profundidade emocional e inconsciente.\n\nForça / Qualidade: Capacidade de enxergar profundamente o parceiro e o vínculo, construindo relações com propósito e intensidade.\n\nManifestação nos relacionamentos: Busca vínculos eternos e profundos, mas pode se perder em jogos de poder, manipulação emocional ou expectativas irreais do parceiro.\n\nAuto percepção / Autoimagem: Quer ser respeitada e compreendida; teme mostrar vulnerabilidade, o que às vezes cria distância emocional.\n\nExpressão: Integrada: Cria vínculos com alma, profundidade e lealdade equilibrada. Em sombra: Procura controle sob a justificativa de amor, absorvendo emoções do parceiro e ignorando limites próprios.",
    "Héstia": "Arquétipo principal: Hera — estruturada e voltada à união.\n\nArquétipo sombra: Héstia — introspectiva, silenciosa e espiritual.\n\nForça / Qualidade: Compromisso sereno, presença constante e capacidade de construir intimidade estável e segura.\n\nManifestação nos relacionamentos: Valoriza a rotina, a intimidade tranquila e a paz dentro da relação. Pode atrair parceiros acomodados ou pouco expressivos.\n\nAuto percepção / Autoimagem: Se percebe madura, confiável e consistente, mas às vezes solitária mesmo acompanhada.\n\nExpressão: Integrada: Traz serenidade, estabilidade e segurança à parceria; fortalece vínculos com gentileza e consistência. Em sombra: Se isola emocionalmente dentro do vínculo, evita confrontos e reprime desejos para manter a aparente harmonia."
  },
  "Héstia": {
    "Pura": "Arquétipo principal: Héstia — silêncio interior, presença, espiritualidade, recolhimento e sabedoria emocional.\n\nArquétipo sombra: Héstia — isolamento, autocontenção excessiva, medo de expressar necessidades e de incomodar os outros.\n\nForça: Héstia + Héstia é o templo vivo da calma e da estabilidade emocional. Sua força está na serenidade profunda, na capacidade de sustentar o próprio centro mesmo diante de crises externas, e em irradiar paz aos que estão ao redor. Tem talento natural para criar ambientes seguros e acolhedores, sendo porto seguro para parceiros, familiares e amigos. Sua presença silenciosa e constante traz conforto e confiança sem precisar provar nada a ninguém.\n\nSombra específica: A sombra de Héstia + Héstia se manifesta quando o desejo de harmonia e recolhimento se torna autocontenção exagerada. Pode reprimir sentimentos e necessidades, evitar conflitos a qualquer custo, e manter silêncio mesmo quando deveria se expressar. Há tendência a se anular para manter a paz, a absorver as emoções alheias sem se proteger e a se isolar emocionalmente, criando um mundo interno inacessível para os outros.\n\nRelacionamentos: Nos relacionamentos, Héstia + Héstia atrai parceiros que apreciam estabilidade e serenidade, mas que podem não perceber suas necessidades emocionais. É propensa a assumir o papel de “guardiã do lar” ou de “refúgio emocional”, oferecendo cuidado, presença e paciência sem exigir reciprocidade visível. Pode manter relações seguras, mas vazias de intensidade ou paixão, tolerando desconexão por medo de romper a harmonia.\n\nAutoimagem: Héstia + Héstia se vê como calma, centrada e essencial na vida dos outros. Orgulha-se de ser confiável, equilibrada e serena. Por dentro, porém, questiona se tem direito de querer mais atenção, emoção ou visibilidade. Luta com sentimentos de invisibilidade e insegurança silenciosa, temendo que a expressão de necessidades desestabilize a relação ou incomode o outro.\n\nExpressão: Quando integrada, Héstia + Héstia cria vínculos serenos, profundos e estáveis. Exerce cuidado e presença de forma equilibrada, irradiando segurança e acolhimento sem perder identidade. Quando em sombra, tende a se isolar emocionalmente, reprimir desejos e sentimentos, e manter relações mornas ou unilaterais por medo de atrito ou rejeição.",
    "Afrodite": "Arquétipo principal: Héstia — calma, introspectiva, espiritual.\n\nArquétipo sombra: Afrodite — sensual, apaixonada, intensa.\n\nForça: Héstia + Afrodite combina serenidade com charme sutil. Irradia paz e magnetismo ao mesmo tempo, oferecendo presença acolhedora que encanta sem alarde. Tem habilidade de manter a própria espiritualidade e calma enquanto aprecia a beleza e o prazer da vida.\n\nSombra específica: Pode reprimir seus desejos e emoções para não perturbar a harmonia. Espera que o outro perceba sua atração ou interesse, e se não percebe, acumula frustração silenciosa. Pode confundir autocontenção com conformismo ou indiferença.\n\nRelacionamentos: Atrai parceiros fascinados pela sua calma e mistério, mas que podem não perceber sua profundidade emocional. Tem tendência a permanecer em relações onde a intensidade não é correspondida ou o parceiro não retribui paixão e afeto.\n\nAutoimagem: Se vê serena, equilibrada e atraente. Secretamente questiona se tem direito de demonstrar desejos e prazer abertamente.\n\nExpressão: Quando integrada, equilibra sedução e espiritualidade, sendo magnética sem perder seu centro. Em sombra, reprime a própria sensualidade e se distancia emocionalmente do parceiro.",
    "Atena": "Arquétipo principal: Héstia — introspectiva, silenciosa e centrada.\n\nArquétipo sombra: Atena — racional, lógica, estratégica.\n\nForça: Héstia + Atena combina clareza mental e calma interior. Resolve problemas com método, mantendo serenidade e presença mesmo em crises. Ama de forma reflexiva, equilibrando razão e intuição.\n\nSombra específica: Racionaliza sentimentos e carências, criando soluções internas em vez de se comunicar. O silêncio torna-se barreira, e o ressentimento acumula de forma sutil.\n\nRelacionamentos: Atração por parceiros que respeitam limites, seguros e organizados. Pode criar vínculos funcionais, porém emocionalmente distantes. O outro sente cuidado, mas dificuldade de conexão profunda.\n\nAutoimagem: Se vê competente, equilibrada e capaz de lidar com qualquer situação, mas teme mostrar vulnerabilidade ou pedir apoio.\n\nExpressão: Quando integrada, ama e atua com equilíbrio entre razão e emoção. Em sombra, se distancia emocionalmente, priorizando lógica em detrimento de conexão afetiva.",
    "Deméter": "Arquétipo principal: Héstia — centrada, espiritual e pacífica.\n\nArquétipo sombra: Deméter — nutridora, protetora, emocional.\n\nForça: Héstia + Deméter combina presença calma com cuidado concreto. Cria lares e relações seguras, oferece acolhimento emocional e suporte silencioso. Sua capacidade de nutrir é real e transformadora.\n\nSombra específica: Ao sustentar e cuidar, invisibiliza suas próprias necessidades. A identidade se confunde com a de “quem cuida”, acumulando culpa e esgotamento quando a reciprocidade não aparece.\n\nRelacionamentos: Assume responsabilidades emocionais e práticas do parceiro/família. Atrai pessoas que dependem do suporte, sem oferecer reciprocidade suficiente.\n\nAutoimagem: Se percebe como essencial e confiável. Internamente deseja reconhecimento e cuidado, mas raramente os verbaliza.\n\nExpressão: Quando integrada, cria vínculos de suporte mútuo, amor silencioso e estabilidade emocional. Em sombra, se apaga em prol do outro, mantendo relações desiguais.",
    "Ártemis": "Arquétipo principal: Héstia — calma, serena e introspectiva.\n\nArquétipo sombra: Ártemis — independente, livre e instintiva.\n\nForça: Héstia + Ártemis é firme e autossuficiente. Protege o próprio espaço e o do outro, mantendo autonomia em qualquer vínculo. Traz estabilidade emocional e liberdade ao mesmo tempo.\n\nSombra específica: Fecha-se para se proteger do risco de ser invadida ou ferida. A autossuficiência vira barreira relacional e pode ser interpretada como desapego ou indiferença.\n\nRelacionamentos: Procura vínculos de baixa demanda emocional, evitando dramas e conflitos. Pode afastar pessoas que desejam aprofundamento imediato ou intensidade emocional.\n\nAutoimagem: Orgulha-se da autonomia e autocontrole. Secretamente sente falta de alguém que aproxime seu silêncio com delicadeza.\n\nExpressão: Quando integrada, ama livremente, mantendo limites saudáveis e autenticidade. Em sombra, se isola, evitando aproximação emocional profunda.",
    "Perséfone": "Arquétipo principal: Héstia — calma, centrada, espiritual.\n\nArquétipo sombra: Perséfone — emocional, profunda e introspectiva.\n\nForça: Héstia + Perséfone combina intuição profunda com serenidade. Capaz de perceber sutilezas emocionais sem se perder, oferece presença curadora, acolhendo dores e emoções sem caos.\n\nSombra específica: Absorve dores alheias e transforma em silêncio interno. Dificuldade de expressar necessidades próprias, gerando sobrecarga emocional silenciosa e confusão no parceiro.\n\nRelacionamentos: Vínculos com quem precisa de apoio emocional, mas que nem sempre oferece reciprocidade. Cria relações onde é refúgio, mas não é plenamente vista ou compreendida.\n\nAutoimagem: Se sente profunda, calma e sábia. Tem receio de mostrar vulnerabilidade por medo de desestabilizar a relação ou ser julgada.\n\nExpressão: Quando integrada, une intuição e serenidade, criando relações curativas e seguras. Em sombra, se esconde atrás do silêncio e da contenção.",
    "Hera": "Arquétipo principal: Héstia — templo interior, calma, recolhimento.\n\nArquétipo sombra: Hera — estruturada, conjugal, comprometida.\n\nForça: Héstia + Hera é o pilar silencioso da estabilidade. Sustenta o lar e o vínculo com discrição, integridade e constância. Valoriza a permanência e cria espaços seguros para parceiros e família.\n\nSombra específica: Evita conflitos para manter harmonia. Acomodação prolongada, retenção de ressentimentos e medo de expressar desejos. Mantém vínculos vazios para não “quebrar” a estrutura construída.\n\nRelacionamentos: Atração por parceiros estáveis, mas pode permanecer em relações sem paixão ou profundidade emocional, assumindo a responsabilidade emocional sozinha.\n\nAutoimagem: Se vê como pilar e guardiã, essencial para a estabilidade da relação. Por dentro, teme que qualquer exigência ou conflito desmorone o que construiu.\n\nExpressão: Quando integrada, cria vínculos calmos, seguros e duradouros. Em sombra, se acomoda emocionalmente, reprime desejos e silencia necessidades, mantendo relações funcionais mas emocionalmente apagadas."
  }
}